src/test/resources/common/soap/jbpapp2127.xml

<soapenv:Envelope xmlns:soapenv='http://schemas.xmlsoap.org/soap/envelope/' xmlns:jbw='http://ws.jboss.org/jbpapp2127'>
  <soapenv:Header/>
  <soapenv:Body>
    <jbw:echo>
      <arg0>123</arg0>
    </jbw:echo>
  </soapenv:Body>
</soapenv:Envelope>